// Определить количество цифр в числе
Console.Write("Введите число: ");
string num = Console.ReadLine();
Console.WriteLine("Количество цифр в заданном числе: " + num.Length);