// Написать программу вычисления значения функции y = f(a)


Console.WriteLine("Введите знаяение а:");
int a = int.Parse(Console.ReadLine());
int y = a + 3;

Console.WriteLine(y);
